TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_unicommi2ct.h
/**
 *  @brief      Get acknowledge override value
 *
 *  @note for General Call this bit will be ignored if set to NACK and
 *  continues to receive data.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     What type of response will be generated
 *
 *  @retval     One of @ref DL_I2CT_RESPONSE_OVERRIDE_VALUE.
 */
__STATIC_INLINE DL_I2CT_RESPONSE_OVERRIDE_VALUE DL_I2CT_getACKOverrideValue(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t value = unicomm->i2ct->ACKCTL & UNICOMMI2CT_ACKCTL_ACKOVAL_MASK;

    return (DL_I2CT_RESPONSE_OVERRIDE_VALUE)(value);
}

/**
 *  @brief      Set acknowledge override value
 *
 *  @note for General Call this bit will be ignored if set to NACK and
 *  continues to receive data.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  value   Indicates what type of response will be generated.
 *                      One of @ref DL_I2CT_RESPONSE_OVERRIDE_VALUE.
 *
 *  @sa         DL_I2CT_enableACKOverride
 */
__STATIC_INLINE void DL_I2CT_setACKOverrideValue(
    UNICOMM_Inst_Regs *unicomm, DL_I2CT_RESPONSE_OVERRIDE_VALUE value)
{
    DL_Common_updateReg(&unicomm->i2ct->ACKCTL, (uint32_t) value,
        UNICOMMI2CT_ACKCTL_ACKOVAL_MASK);
}

/**
 *  @brief      Disable ACK override on Start Condition
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_disableACKOverrideOnStart(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->ACKCTL &= ~(UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_MASK);
}

/**
 *  @brief      Checks if ACK override on Start condition is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If ACK override on Start condition is enabled
 *
 *  @retval     true if ACK override on Start condition is enabled
 *  @retval     false if ACK override on Start condition is disabled
 */
__STATIC_INLINE bool DL_I2CT_isACKOverrideOnStartEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return (
        (unicomm->i2ct->ACKCTL & UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_MASK) ==
        UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_ENABLE);
}

/**
 *  @brief      Enable ACK override on Start condition
 *
 *  When enabled, this bit will automatically turn on the ACKOEN field
 *  following a Start condition.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @sa                 DL_I2CT_enableACKOverride
 */
__STATIC_INLINE void DL_I2CT_enableACKOverrideOnStart(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->ACKCTL |= UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_ENABLE;
}

/**
 *  @brief      Disable ACK override when SMBus/PMBus PEC is next byte
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_disableACKOverrideOnPECNext(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->ACKCTL &= ~(UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_MASK);
}

/**
 *  @brief      Checks if ACK override when SMBus/PMBus PEC is next byte
 *              is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If ACK override when PEC is next byte is enabled
 *
 *  @retval     true if ACK override when PEC is next byte is enabled
 *  @retval     false if ACK override when PEC is next byte is disabled
 */
__STATIC_INLINE bool DL_I2CT_isACKOverrideOnPECNextEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return (
        (unicomm->i2ct->ACKCTL & UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_MASK) ==
        UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_ENABLE);
}

/**
 *  @brief      Enable ACK override when SMBus/PMBus PEC is next byte
 *
 *  When enabled, this bit will automatically turn on the ACKOEN field
 *  following the ACK/NACK of the byte received just prior to the PEC byte.
 *  Note that when ACKOEN is set, the PEC byte will not automatically be
 *  ACKed/NACKed by the state machine and FW must perform this function by
 *  writing SLAVE_SACKCTL.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @sa                 DL_I2CT_enableACKOverride
 */
__STATIC_INLINE void DL_I2CT_enableACKOverrideOnPECNext(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->ACKCTL |= UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_ENABLE;
}

/**
 *  @brief      Disable ACK override when SMBus/PMBus PEC is next byte
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_disableACKOverrideOnPECDone(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->ACKCTL &= ~(UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_MASK);
}

/**
 *  @brief      Checks if ACK override when SMBus/PMBus PEC is next byte
 *              is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If ACK override when PEC is next byte is enabled
 *
 *  @retval     true if ACK override when PEC is next byte is enabled
 *  @retval     false if ACK override when PEC is next byte is disabled
 */
__STATIC_INLINE bool DL_I2CT_isACKOverrideOnPECDoneEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return (
        (unicomm->i2ct->ACKCTL & UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_MASK) ==
        UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_ENABLE);
}

/**
 *  @brief      Enable ACK override when SMBus/PMBus PEC is done
 *
 *  When enabled, this bit will automatically turn on the ACKOEN field
 * following the ACK/NACK of the received PEC byte.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @sa                 DL_I2CT_enableACKOverride
 */
__STATIC_INLINE void DL_I2CT_enableACKOverrideOnPECDone(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->ACKCTL |= UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_ENABLE;
}

/**
 *  @brief      Get the SMBus/PMBus Packet Error Checking (PEC) count
 *              value
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     The value the PEC count is set to
 *
 *  @retval     Value between [0x0, 0x01FF]
 */
__STATIC_INLINE uint32_t DL_I2CT_getPECCountValue(UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->i2ct->PECCTL & UNICOMMI2CT_PECCTL_PECCNT_MASK);
}

/**
 *  @brief      Set the SMBus/PMBus Packet Error Checking (PEC) count
 *              value
 *
 *  When this field is non zero, the number of I2CT data bytes are counted.
 *  Refer to the device TRM for more details.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  count   The value to set the PEC count to.
 *                      Value between [0x0, 0x01FF]
 */
__STATIC_INLINE void DL_I2CT_setPECCountValue(
    UNICOMM_Inst_Regs *unicomm, uint32_t count)
{
    DL_Common_updateReg(
        &unicomm->i2ct->PECCTL, count, UNICOMMI2CT_PECCTL_PECCNT_MASK);
}

/**
 *  @brief      Disable SMBus/PMBus Packet Error Checking (PEC)
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_disablePEC(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->PECCTL &= ~(UNICOMMI2CT_PECCTL_PECEN_MASK);
}

/**
 *  @brief      Checks if SMBus/PMBus Packet Error Checking (PEC) is
 *              enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If PEC is enabled
 *
 *  @retval     true if PEC is enabled
 *  @retval     false if PEC is disabled
 */
__STATIC_INLINE bool DL_I2CT_isPECEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2ct->PECCTL & UNICOMMI2CT_PECCTL_PECEN_MASK) ==
            UNICOMMI2CT_PECCTL_PECEN_ENABLE);
}

/**
 *  @brief      Enable SMBus/PMBus Packet Error Checking (PEC)
 *
 *  When enabled, the PEC is calculated on all bits accept the Start, Stop, ACK
 *  and NACK. The PEC LSFR and the Byte Counter is set to 0 when the State
 *  Machine is in the IDLE state, which occurs following a Stop or when a
 *  timeout occurs. The Counter is also set to 0 after the PEC byte is sent or
 *  received. Note that the NACK is automatically sent following a PEC byte
 *  that results in a PEC error.
 *  The PEC Polynomial is x^8 + x^2 + x^1 + 1.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_I2CT_enablePEC(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->PECCTL |= UNICOMMI2CT_PECCTL_PECEN_ENABLE;
}

/**
 *  @brief      Get the current SMBus/PMBus PEC byte count of the state
 *              machine
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     The current PEC byte count of the state macione
 *
 *  @retval     Value between [0x0, 0x01FF]
 */
__STATIC_INLINE uint32_t DL_I2CT_getCurrentPECCount(UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->i2ct->PECSR & UNICOMMI2CT_PECSR_PECBYTECNT_MASK);
}

/**
 *  @brief      Get status if SMBus/PMBus PEC was checked in last
 *              transaction
 *
 *  The status indicates if the PEC was checked in the transaction that
 *  occurred before the last Stop. Latched on Stop.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     Status of PEC checked
 *
 *  @retval     One of @ref DL_I2CT_PEC_STATUS
 */
__STATIC_INLINE DL_I2CT_PEC_STATUS DL_I2CT_getPECCheckedStatus(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t status =
        unicomm->i2ct->PECSR & UNICOMMI2CT_PECSR_PECSTS_CHECK_MASK;

    return (DL_I2CT_PEC_STATUS)(status);
}

/**
 *  @brief      Get status if SMBus/PMBus PEC had an error
 *
 *  The status indicates if a PEC check error occurred in the transaction that
 *  occurred before the last Stop. Latched on Stop.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     Status of PEC error check
 *
 *  @retval     One of @ref DL_I2CT_PEC_CHECK_ERROR
 */
__STATIC_INLINE DL_I2CT_PEC_CHECK_ERROR DL_I2CT_getPECCheckError(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t status =
        unicomm->i2ct->PECSR & UNICOMMI2CT_PECSR_PECSTS_ERROR_MASK;

